bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F730.svd
            <register>
               <name>AFRL</name>
               <displayName>AFRL</displayName>
               <description>GPIO alternate function           lowregister</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AFRL7</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRL6</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRL5</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRL4</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRL3</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRL2</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRL1</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRL0</name>
                     <description>Alternate function selection for port x               bit y (y = 0..7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AFRH</name>
               <displayName>AFRH</displayName>
               <description>GPIO alternate function high           register</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>AFRH15</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRH14</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRH13</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRH12</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRH11</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRH10</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRH9</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AFRH8</name>
                     <description>Alternate function selection for port x               bit y (y = 8..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="GPIOH">
         <name>GPIOF</name>
         <baseAddress>0x40021400</baseAddress>
      </peripheral>
      <peripheral derivedFrom="GPIOH">
         <name>GPIOG</name>
         <baseAddress>0x40021800</baseAddress>
      </peripheral>
      <peripheral derivedFrom="GPIOH">
         <name>GPIOI</name>
         <baseAddress>0x40022000</baseAddress>
      </peripheral>
      <peripheral derivedFrom="GPIOH">
         <name>GPIOE</name>
         <baseAddress>0x40021000</baseAddress>
      </peripheral>
      <peripheral derivedFrom="GPIOH">
         <name>GPIOD</name>
         <baseAddress>0x40020C00</baseAddress>
      </peripheral>
      <peripheral derivedFrom="GPIOH">
         <name>GPIOC</name>
         <baseAddress>0x40020800</baseAddress>
      </peripheral>
      <peripheral>
         <name>GPIOB</name>
         <description>General-purpose I/Os</description>
         <groupName>GPIO</groupName>
         <baseAddress>0x40020400</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MODER</name>
               <displayName>MODER</displayName>
               <description>GPIO port mode register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000280</resetValue>
               <fields>
                  <field>
                     <name>MODER15</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER14</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER13</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER12</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER11</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER10</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER9</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER8</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER7</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER6</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER5</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER4</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER3</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER2</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER1</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>MODER0</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTYPER</name>
               <displayName>OTYPER</displayName>
               <description>GPIO port output type register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>OT15</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT14</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT13</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT12</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT11</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT10</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT9</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT8</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT7</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT6</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT5</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT4</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT3</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT2</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT1</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OT0</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OSPEEDR</name>
               <displayName>OSPEEDR</displayName>
               <description>GPIO port output speed           register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000C0</resetValue>
               <fields>
                  <field>
                     <name>OSPEEDR15</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR14</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR13</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR12</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR11</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR10</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR9</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR8</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR7</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR6</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR5</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR4</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR3</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR2</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR1</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>OSPEEDR0</name>
                     <description>Port x configuration bits (y =               0..15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
