bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F730.svd
            <register>
               <name>AHB1LPENR</name>
               <displayName>AHB1LPENR</displayName>
               <description>AHB1 peripheral clock enable in low power           mode register</description>
               <addressOffset>0x50</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x7E6791FF</resetValue>
               <fields>
                  <field>
                     <name>GPIOALPEN</name>
                     <description>IO port A clock enable during sleep               mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOBLPEN</name>
                     <description>IO port B clock enable during Sleep               mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOCLPEN</name>
                     <description>IO port C clock enable during Sleep               mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIODLPEN</name>
                     <description>IO port D clock enable during Sleep               mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOELPEN</name>
                     <description>IO port E clock enable during Sleep               mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOFLPEN</name>
                     <description>IO port F clock enable during Sleep               mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOGLPEN</name>
                     <description>IO port G clock enable during Sleep               mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOHLPEN</name>
                     <description>IO port H clock enable during Sleep               mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOILPEN</name>
                     <description>IO port I clock enable during Sleep               mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOJLPEN</name>
                     <description>IO port J clock enable during Sleep               mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>GPIOKLPEN</name>
                     <description>IO port K clock enable during Sleep               mode</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCLPEN</name>
                     <description>CRC clock enable during Sleep               mode</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FLITFLPEN</name>
                     <description>Flash interface clock enable during               Sleep mode</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM1LPEN</name>
                     <description>SRAM 1interface clock enable during               Sleep mode</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM2LPEN</name>
                     <description>SRAM 2 interface clock enable during               Sleep mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BKPSRAMLPEN</name>
                     <description>Backup SRAM interface clock enable               during Sleep mode</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM3LPEN</name>
                     <description>SRAM 3 interface clock enable during               Sleep mode</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA1LPEN</name>
                     <description>DMA1 clock enable during Sleep               mode</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2LPEN</name>
                     <description>DMA2 clock enable during Sleep               mode</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMA2DLPEN</name>
                     <description>DMA2D clock enable during Sleep               mode</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ETHMACLPEN</name>
                     <description>Ethernet MAC clock enable during Sleep               mode</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ETHMACTXLPEN</name>
                     <description>Ethernet transmission clock enable               during Sleep mode</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ETHMACRXLPEN</name>
                     <description>Ethernet reception clock enable during               Sleep mode</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ETHMACPTPLPEN</name>
                     <description>Ethernet PTP clock enable during Sleep               mode</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTGHSLPEN</name>
                     <description>USB OTG HS clock enable during Sleep               mode</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OTGHSULPILPEN</name>
                     <description>USB OTG HS ULPI clock enable during               Sleep mode</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AXILPEN</name>
                     <description>AXI to AHB bridge clock enable during               Sleep mode</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTCMLPEN</name>
                     <description>DTCM RAM interface clock enable during               Sleep mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AHB2LPENR</name>
               <displayName>AHB2LPENR</displayName>
               <description>AHB2 peripheral clock enable in low power           mode register</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x000000F1</resetValue>
               <fields>
                  <field>
                     <name>OTGFSLPEN</name>
                     <description>USB OTG FS clock enable during Sleep               mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RNGLPEN</name>
                     <description>Random number generator clock enable               during Sleep mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AESLPEN</name>
                     <description>AES module clock enable during Sleep               mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AHB3LPENR</name>
               <displayName>AHB3LPENR</displayName>
               <description>AHB3 peripheral clock enable in low power           mode register</description>
               <addressOffset>0x58</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000001</resetValue>
               <fields>
                  <field>
                     <name>FMCLPEN</name>
                     <description>Flexible memory controller module clock               enable during Sleep mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>QSPILPEN</name>
                     <description>Quand SPI memory controller clock enable               during Sleep mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>APB1LPENR</name>
               <displayName>APB1LPENR</displayName>
               <description>APB1 peripheral clock enable in low power           mode register</description>
               <addressOffset>0x60</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x36FEC9FF</resetValue>
               <fields>
                  <field>
                     <name>TIM2LPEN</name>
                     <description>TIM2 clock enable during Sleep               mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM3LPEN</name>
                     <description>TIM3 clock enable during Sleep               mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM4LPEN</name>
                     <description>TIM4 clock enable during Sleep               mode</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM5LPEN</name>
                     <description>TIM5 clock enable during Sleep               mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM6LPEN</name>
                     <description>TIM6 clock enable during Sleep               mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM7LPEN</name>
                     <description>TIM7 clock enable during Sleep               mode</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM12LPEN</name>
                     <description>TIM12 clock enable during Sleep               mode</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM13LPEN</name>
                     <description>TIM13 clock enable during Sleep               mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TIM14LPEN</name>
                     <description>TIM14 clock enable during Sleep               mode</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WWDGLPEN</name>
                     <description>Window watchdog clock enable during               Sleep mode</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI2LPEN</name>
                     <description>SPI2 clock enable during Sleep               mode</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SPI3LPEN</name>
                     <description>SPI3 clock enable during Sleep               mode</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART2LPEN</name>
                     <description>USART2 clock enable during Sleep               mode</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USART3LPEN</name>
                     <description>USART3 clock enable during Sleep               mode</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART4LPEN</name>
                     <description>UART4 clock enable during Sleep               mode</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART5LPEN</name>
                     <description>UART5 clock enable during Sleep               mode</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1LPEN</name>
                     <description>I2C1 clock enable during Sleep               mode</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C2LPEN</name>
                     <description>I2C2 clock enable during Sleep               mode</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3LPEN</name>
                     <description>I2C3 clock enable during Sleep               mode</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAN1LPEN</name>
                     <description>CAN 1 clock enable during Sleep               mode</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CAN2LPEN</name>
                     <description>CAN 2 clock enable during Sleep               mode</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWRLPEN</name>
                     <description>Power interface clock enable during               Sleep mode</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DACLPEN</name>
                     <description>DAC interface clock enable during Sleep               mode</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART7LPEN</name>
                     <description>UART7 clock enable during Sleep               mode</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UART8LPEN</name>
                     <description>UART8 clock enable during Sleep               mode</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPTIM1LPEN</name>
                     <description>low power timer 1 clock enable during               Sleep mode</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
