bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F730.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="SPI5">
         <name>SPI1</name>
         <baseAddress>0x40013000</baseAddress>
         <interrupt>
            <name>SPI1</name>
            <description>SPI1 global interrupt</description>
            <value>35</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SPI5">
         <name>SPI2</name>
         <baseAddress>0x40003800</baseAddress>
         <interrupt>
            <name>SPI2</name>
            <description>SPI2 global interrupt</description>
            <value>36</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SPI5">
         <name>SPI4</name>
         <baseAddress>0x40013400</baseAddress>
         <interrupt>
            <name>SPI4</name>
            <description>SPI 4 global interrupt</description>
            <value>84</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="SPI5">
         <name>SPI3</name>
         <baseAddress>0x40003C00</baseAddress>
         <interrupt>
            <name>SPI3</name>
            <description>SPI3 global interrupt</description>
            <value>51</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>SYSCFG</name>
         <description>System configuration controller</description>
         <groupName>SYSCFG</groupName>
         <baseAddress>0x40013800</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MEMRMP</name>
               <displayName>MEMRMP</displayName>
               <description>memory remap register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MEM_BOOT</name>
                     <description>Memory boot mapping</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWP_FMC</name>
                     <description>FMC memory mapping swap</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMC</name>
               <displayName>PMC</displayName>
               <description>peripheral mode configuration           register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PB7_FMP</name>
                     <description>PB7_FMP Fast Mode + Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PB8_FMP</name>
                     <description>PB8_FMP Fast Mode + Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PB9_FMP</name>
                     <description>Fast Mode + Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADCDC2</name>
                     <description>ADC3DC2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>PB6_FMP</name>
                     <description>PB6_FMP Fast Mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C3_FMP</name>
                     <description>I2C3_FMP I2C3 Fast Mode +               Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C2_FMP</name>
                     <description>I2C2_FMP I2C2 Fast Mode +               Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2C1_FMP</name>
                     <description>I2C1_FMP I2C1 Fast Mode +               Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTICR1</name>
               <displayName>EXTICR1</displayName>
               <description>external interrupt configuration register           1</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>EXTI3</name>
                     <description>EXTI x configuration (x = 0 to               3)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI2</name>
                     <description>EXTI x configuration (x = 0 to               3)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI1</name>
                     <description>EXTI x configuration (x = 0 to               3)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI0</name>
                     <description>EXTI x configuration (x = 0 to               3)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTICR2</name>
               <displayName>EXTICR2</displayName>
               <description>external interrupt configuration register           2</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>EXTI7</name>
                     <description>EXTI x configuration (x = 4 to               7)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI6</name>
                     <description>EXTI x configuration (x = 4 to               7)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI5</name>
                     <description>EXTI x configuration (x = 4 to               7)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI4</name>
                     <description>EXTI x configuration (x = 4 to               7)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTICR3</name>
               <displayName>EXTICR3</displayName>
               <description>external interrupt configuration register           3</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>EXTI11</name>
                     <description>EXTI x configuration (x = 8 to               11)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI10</name>
                     <description>EXTI10</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI9</name>
                     <description>EXTI x configuration (x = 8 to               11)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI8</name>
                     <description>EXTI x configuration (x = 8 to               11)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>EXTICR4</name>
               <displayName>EXTICR4</displayName>
               <description>external interrupt configuration register           4</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>EXTI15</name>
                     <description>EXTI x configuration (x = 12 to               15)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI14</name>
                     <description>EXTI x configuration (x = 12 to               15)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI13</name>
                     <description>EXTI x configuration (x = 12 to               15)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>EXTI12</name>
                     <description>EXTI x configuration (x = 12 to               15)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMPCR</name>
               <displayName>CMPCR</displayName>
               <description>Compensation cell control           register</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>READY</name>
                     <description>READY</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CMP_PD</name>
                     <description>Compensation cell               power-down</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
