bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F730.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>OTG_FS_GLOBAL</name>
         <description>USB on the go full speed</description>
         <groupName>USB_OTG_FS</groupName>
         <baseAddress>0x50000000</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>OTG_FS_GOTGCTL</name>
               <displayName>OTG_FS_GOTGCTL</displayName>
               <description>OTG_FS control and status register           (OTG_FS_GOTGCTL)</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000800</resetValue>
               <fields>
                  <field>
                     <name>SRQSCS</name>
                     <description>Session request success</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SRQ</name>
                     <description>Session request</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HNGSCS</name>
                     <description>Host negotiation success</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HNPRQ</name>
                     <description>HNP request</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSHNPEN</name>
                     <description>Host set HNP enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DHNPEN</name>
                     <description>Device HNP enabled</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CIDSTS</name>
                     <description>Connector ID status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>DBCT</name>
                     <description>Long/short debounce time</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ASVLD</name>
                     <description>A-session valid</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>BSVLD</name>
                     <description>B-session valid</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>VBVALOEN</name>
                     <description>VBUS valid override enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>VBVALOVAL</name>
                     <description>VBUS valid override value</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>AVALOEN</name>
                     <description>A-peripheral session valid override               enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>AVALOVAL</name>
                     <description>A-peripheral session valid override               value</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BVALOEN</name>
                     <description>B-peripheral session valid override               enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BVALOVAL</name>
                     <description>B-peripheral session valid override               value</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EHEN</name>
                     <description>Embedded host enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OTGVER</name>
                     <description>OTG version</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GOTGINT</name>
               <displayName>OTG_FS_GOTGINT</displayName>
               <description>OTG_FS interrupt register           (OTG_FS_GOTGINT)</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SEDET</name>
                     <description>Session end detected</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRSSCHG</name>
                     <description>Session request success status               change</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HNSSCHG</name>
                     <description>Host negotiation success status               change</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HNGDET</name>
                     <description>Host negotiation detected</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADTOCHG</name>
                     <description>A-device timeout change</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DBCDNE</name>
                     <description>Debounce done</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IDCHNG</name>
                     <description>ID input pin changed</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GAHBCFG</name>
               <displayName>OTG_FS_GAHBCFG</displayName>
               <description>OTG_FS AHB configuration register           (OTG_FS_GAHBCFG)</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>GINT</name>
                     <description>Global interrupt mask</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFELVL</name>
                     <description>TxFIFO empty level</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTXFELVL</name>
                     <description>Periodic TxFIFO empty               level</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GUSBCFG</name>
               <displayName>OTG_FS_GUSBCFG</displayName>
               <description>OTG_FS USB configuration register           (OTG_FS_GUSBCFG)</description>
               <addressOffset>0xC</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000A00</resetValue>
               <fields>
                  <field>
                     <name>TOCAL</name>
                     <description>FS timeout calibration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PHYSEL</name>
                     <description>Full Speed serial transceiver               select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                  </field>
                  <field>
                     <name>SRPCAP</name>
                     <description>SRP-capable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HNPCAP</name>
                     <description>HNP-capable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TRDT</name>
                     <description>USB turnaround time</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FHMOD</name>
                     <description>Force host mode</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FDMOD</name>
                     <description>Force device mode</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GRSTCTL</name>
               <displayName>OTG_FS_GRSTCTL</displayName>
               <description>OTG_FS reset register           (OTG_FS_GRSTCTL)</description>
               <addressOffset>0x10</addressOffset>
               <size>0x20</size>
               <resetValue>0x20000000</resetValue>
               <fields>
                  <field>
                     <name>CSRST</name>
                     <description>Core soft reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HSRST</name>
                     <description>HCLK soft reset</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>FCRST</name>
                     <description>Host frame counter reset</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RXFFLSH</name>
                     <description>RxFIFO flush</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXFFLSH</name>
                     <description>TxFIFO flush</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>TXFNUM</name>
                     <description>TxFIFO number</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>5</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>AHBIDL</name>
                     <description>AHB master idle</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GINTSTS</name>
               <displayName>OTG_FS_GINTSTS</displayName>
               <description>OTG_FS core interrupt register           (OTG_FS_GINTSTS)</description>
               <addressOffset>0x14</addressOffset>
               <size>0x20</size>
               <resetValue>0x04000020</resetValue>
               <fields>
                  <field>
                     <name>CMOD</name>
                     <description>Current mode of operation</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>MMIS</name>
                     <description>Mode mismatch interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OTGINT</name>
                     <description>OTG interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SOF</name>
                     <description>Start of frame</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RXFLVL</name>
                     <description>RxFIFO non-empty</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>NPTXFE</name>
                     <description>Non-periodic TxFIFO empty</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>GINAKEFF</name>
                     <description>Global IN non-periodic NAK               effective</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>GOUTNAKEFF</name>
                     <description>Global OUT NAK effective</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ESUSP</name>
                     <description>Early suspend</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>USBSUSP</name>
                     <description>USB suspend</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>USBRST</name>
                     <description>USB reset</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ENUMDNE</name>
                     <description>Enumeration done</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ISOODRP</name>
                     <description>Isochronous OUT packet dropped               interrupt</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EOPF</name>
                     <description>End of periodic frame               interrupt</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IEPINT</name>
                     <description>IN endpoint interrupt</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>OEPINT</name>
                     <description>OUT endpoint interrupt</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>IISOIXFR</name>
                     <description>Incomplete isochronous IN               transfer</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IPXFR_INCOMPISOOUT</name>
                     <description>Incomplete periodic transfer(Host               mode)/Incomplete isochronous OUT transfer(Device               mode)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>HPRTINT</name>
                     <description>Host port interrupt</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HCINT</name>
                     <description>Host channels interrupt</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>PTXFE</name>
                     <description>Periodic TxFIFO empty</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>CIDSCHG</name>
                     <description>Connector ID status change</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DISCINT</name>
                     <description>Disconnect detected               interrupt</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SRQINT</name>
                     <description>Session request/new session detected               interrupt</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WKUPINT</name>
                     <description>Resume/remote wakeup detected               interrupt</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RSTDET</name>
                     <description>Reset detected interrupt</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
