bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F730.svd
            <register>
               <name>OTG_FS_DIEPTXF3</name>
               <displayName>OTG_FS_DIEPTXF3</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO size           register (OTG_FS_DIEPTXF3)</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFO4 transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GRXSTSP_Device</name>
               <displayName>OTG_FS_GRXSTSP_Device</displayName>
               <description>OTG status read and pop register (Device           mode)</description>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>EPNUM</name>
                     <description>Endpoint number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BCNT</name>
                     <description>Byte count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>DPID</name>
                     <description>Data PID</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTSTS</name>
                     <description>Packet status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FRMNUM</name>
                     <description>Frame number</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GRXSTSP_Host</name>
               <displayName>OTG_FS_GRXSTSP_Host</displayName>
               <description>OTG status read and pop register (Host           mode)</description>
               <alternateRegister>OTG_FS_GRXSTSP_Device</alternateRegister>
               <addressOffset>0x20</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>CHNUM</name>
                     <description>Channel number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BCNT</name>
                     <description>Byte count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>DPID</name>
                     <description>Data PID</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTSTS</name>
                     <description>Packet status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GI2CCTL</name>
               <displayName>OTG_FS_GI2CCTL</displayName>
               <description>OTG I2C access register</description>
               <addressOffset>0x30</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>RWDATA</name>
                     <description>I2C Read/Write Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>REGADDR</name>
                     <description>I2C Register Address</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>ADDR</name>
                     <description>I2C Address</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>I2CEN</name>
                     <description>I2C Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ACK</name>
                     <description>I2C ACK</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2CDEVADR</name>
                     <description>I2C Device Address</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>I2CDATSE0</name>
                     <description>I2C DatSe0 USB mode</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RW</name>
                     <description>Read/Write Indicator</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BSYDNE</name>
                     <description>I2C Busy/Done</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DIEPTXF4</name>
               <displayName>OTG_FS_DIEPTXF4</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO size           register (OTG_FS_DIEPTXF4)</description>
               <addressOffset>0x110</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFOx transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint Tx FIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_DIEPTXF5</name>
               <displayName>OTG_FS_DIEPTXF5</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO size           register (OTG_FS_DIEPTXF5)</description>
               <addressOffset>0x114</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFOx transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint Tx FIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OTG_FS_GLPMCFG</name>
               <displayName>OTG_FS_GLPMCFG</displayName>
               <description>OTG core LPM configuration           register</description>
               <addressOffset>0x54</addressOffset>
               <size>0x20</size>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>LPMEN</name>
                     <description>LPM support enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPMACK</name>
                     <description>LPM token acknowledge               enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BESL</name>
                     <description>Best effort service               latency</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>REMWAKE</name>
                     <description>bRemoteWake value</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>L1SSEN</name>
                     <description>L1 Shallow Sleep enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>BESLTHRS</name>
                     <description>BESL threshold</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>L1DSEN</name>
                     <description>L1 deep sleep enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPMRST</name>
                     <description>LPM response</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>SLPSTS</name>
                     <description>Port sleep status</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>L1RSMOK</name>
                     <description>Sleep State Resume OK</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>LPMCHIDX</name>
                     <description>LPM Channel Index</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPMRCNT</name>
                     <description>LPM retry count</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SNDLPM</name>
                     <description>Send LPM transaction</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>LPMRCNTSTS</name>
                     <description>LPM retry count status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>3</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>ENBESL</name>
                     <description>Enable best effort service               latency</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
