bluekitchen/btstack/port/stm32-f4discovery-csr8x11/doc/STMicro/STM32F730.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>WWDG</name>
         <description>Window watchdog</description>
         <groupName>WWDG</groupName>
         <baseAddress>0x40002C00</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x400</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>WWDG</name>
            <description>Window Watchdog interrupt</description>
            <value>0</value>
         </interrupt>
         <registers>
            <register>
               <name>CR</name>
               <displayName>CR</displayName>
               <description>Control register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x7F</resetValue>
               <fields>
                  <field>
                     <name>WDGA</name>
                     <description>Activation bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>T</name>
                     <description>7-bit counter (MSB to LSB)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CFR</name>
               <displayName>CFR</displayName>
               <description>Configuration register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x7F</resetValue>
               <fields>
                  <field>
                     <name>EWI</name>
                     <description>Early wakeup interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDGTB1</name>
                     <description>Timer base</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDGTB0</name>
                     <description>Timer base</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>W</name>
                     <description>7-bit window value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SR</name>
               <displayName>SR</displayName>
               <description>Status register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>EWIF</name>
                     <description>Early wakeup interrupt               flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>NVIC</name>
         <description>Nested Vectored Interrupt       Controller</description>
         <groupName>NVIC</groupName>
         <baseAddress>0xE000E100</baseAddress>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x371</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>ISER0</name>
               <displayName>ISER0</displayName>
               <description>Interrupt Set-Enable Register</description>
               <addressOffset>0x0</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SETENA</name>
                     <description>SETENA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISER1</name>
               <displayName>ISER1</displayName>
               <description>Interrupt Set-Enable Register</description>
               <addressOffset>0x4</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SETENA</name>
                     <description>SETENA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISER2</name>
               <displayName>ISER2</displayName>
               <description>Interrupt Set-Enable Register</description>
               <addressOffset>0x8</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SETENA</name>
                     <description>SETENA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICER0</name>
               <displayName>ICER0</displayName>
               <description>Interrupt Clear-Enable           Register</description>
               <addressOffset>0x80</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRENA</name>
                     <description>CLRENA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICER1</name>
               <displayName>ICER1</displayName>
               <description>Interrupt Clear-Enable           Register</description>
               <addressOffset>0x84</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRENA</name>
                     <description>CLRENA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICER2</name>
               <displayName>ICER2</displayName>
               <description>Interrupt Clear-Enable           Register</description>
               <addressOffset>0x88</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRENA</name>
                     <description>CLRENA</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISPR0</name>
               <displayName>ISPR0</displayName>
               <description>Interrupt Set-Pending Register</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SETPEND</name>
                     <description>SETPEND</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISPR1</name>
               <displayName>ISPR1</displayName>
               <description>Interrupt Set-Pending Register</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SETPEND</name>
                     <description>SETPEND</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISPR2</name>
               <displayName>ISPR2</displayName>
               <description>Interrupt Set-Pending Register</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SETPEND</name>
                     <description>SETPEND</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICPR0</name>
               <displayName>ICPR0</displayName>
               <description>Interrupt Clear-Pending           Register</description>
               <addressOffset>0x180</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRPEND</name>
                     <description>CLRPEND</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICPR1</name>
               <displayName>ICPR1</displayName>
               <description>Interrupt Clear-Pending           Register</description>
               <addressOffset>0x184</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRPEND</name>
                     <description>CLRPEND</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ICPR2</name>
               <displayName>ICPR2</displayName>
               <description>Interrupt Clear-Pending           Register</description>
               <addressOffset>0x188</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLRPEND</name>
                     <description>CLRPEND</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IABR0</name>
               <displayName>IABR0</displayName>
               <description>Interrupt Active Bit Register</description>
               <addressOffset>0x200</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACTIVE</name>
                     <description>ACTIVE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IABR1</name>
               <displayName>IABR1</displayName>
               <description>Interrupt Active Bit Register</description>
               <addressOffset>0x204</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACTIVE</name>
                     <description>ACTIVE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IABR2</name>
               <displayName>IABR2</displayName>
               <description>Interrupt Active Bit Register</description>
               <addressOffset>0x208</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ACTIVE</name>
                     <description>ACTIVE</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR0</name>
               <displayName>IPR0</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x300</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR1</name>
               <displayName>IPR1</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x304</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR2</name>
               <displayName>IPR2</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x308</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR3</name>
               <displayName>IPR3</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x30C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR4</name>
               <displayName>IPR4</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x310</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR5</name>
               <displayName>IPR5</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x314</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR6</name>
               <displayName>IPR6</displayName>
               <description>Interrupt Priority Register</description>
               <addressOffset>0x318</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>IPR_N0</name>
                     <description>IPR_N0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N1</name>
                     <description>IPR_N1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N2</name>
                     <description>IPR_N2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>IPR_N3</name>
                     <description>IPR_N3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
